blog/2023/12/passive-mail-fingerprinting/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-04-28 Mon 17:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Passive Mail Server Fingerprinting with DNS</title>
<meta name="author" content="kb" />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">

<meta name="author" content="Kenny Ballou">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<title>~kb</title>

<link rel="canonical" href="/" />
<link href="/index.xml" rel="alternate" type="application/rss+xml"
      title="~kb/blog" />

<link rel="stylesheet" href="/css/simple.css" />
<link rel="stylesheet" href="/css/simple.add.css" />
<link rel="stylesheet" href="/css/katex.css" />
<link rel="stylesheet" href="/css/all.min.css" />
<link rel="shortcut icon" href="/favicon.ico" type="image/x-icon" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://kennyballou.com/blog"> UP </a>
 |
 <a accesskey="H" href="https://kennyballou.com/"> HOME </a>
</div><header id="" class="status">
<nav>
  <a href="/">
    <i class="fade fas fa-home"></i>
  </a>
  <a href="/about.html">
    <i class="fade fas fa-user-circle"></i>
  </a>
  <a href="https://git.sr.ht/~kennyballou/"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade far fa-circle fa-1x"></i>
  </a>
  <a href="https://github.com/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-github fa-1x"></i>
  </a>
  <a href="https://bitbucket.org/kballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-bitbucket fa-1x"></i>
  </a>
  <a href="https://orcid.org/0000-0002-6032-474X"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-orcid"></i>
  </a>
  <a href="https://linkedin.com/in/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-linkedin-in fa-1x"></i>
  </a>
  <a href="/support.html">
    <i class="fade fas fa-heart fa-1x"></i>
  </a>
  <a href="/cv.pdf"
     target="_blank">
    <i class="fade far fa-file-pdf"></i>
  </a>
  <a href="/B74CC4B41148C3DB364BC21182D94B35744E1B34.asc"
     target="_blank">
    <i class="fade fas fa-key"></i>
  </a>
  <a href="/index.xml" rel="alternate"
     type="application/rss+xml">
    <i class="fade fas fa-rss fa-1x"></i>
  </a>
</nav>
</header>
<div id="main" class="content">
<h1 class="title">Passive Mail Server Fingerprinting with DNS</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgedd155e">Paranoid Queries</a></li>
<li><a href="#org0d951f6">Legal Caveats and Caution</a></li>
</ul>
</div>
</div>
<div class="PREVIEW" id="orgfd1c6c4">
<p>
We can easily identify mail servers with <a href="https://www.wikiwand.com/en/MX_record">MX records</a>.  Given only a server name
for a particular organization, we can passively fingerprint the email server
with a simple DNS query.
</p>

</div>

<p>
In the quiet part of information gathering phase for security research, it is
important to gather as much information as possible <b>without</b> contacting the
organization, or its servers.  Since email is such an important part of any
organization's operation, we may want to know who or what is operating their
mail servers, and where those server(s) might be.  Furthermore, since many
people now outsource email hosting, we can trivially identify the hosting
provider for most organizations using a simple DNS query:
</p>

<div class="org-src-container">
<pre class="src src-bash">guix shell bind:utils -- dig MX kennyballou.com
</pre>
</div>

<pre class="example" id="org9618aec">

; &lt;&lt;&gt;&gt; DiG 9.16.38 &lt;&lt;&gt;&gt; MX kennyballou.com
;; global options: +cmd
;; Got answer:
;; -&gt;&gt;HEADER&lt;&lt;- opcode: QUERY, status: NOERROR, id: 58490
;; flags: qr rd ra; QUERY: 1, ANSWER: 5, AUTHORITY: 0, ADDITIONAL: 1

;; OPT PSEUDOSECTION:
; EDNS: version: 0, flags:; udp: 4096
;; QUESTION SECTION:
;kennyballou.com.		IN	MX

;; ANSWER SECTION:
kennyballou.com.	86400	IN	MX	1 aspmx.l.google.com.
kennyballou.com.	86400	IN	MX	5 alt1.aspmx.l.google.com.
kennyballou.com.	86400	IN	MX	5 alt2.aspmx.l.google.com.
kennyballou.com.	86400	IN	MX	10 alt3.aspmx.l.google.com.
kennyballou.com.	86400	IN	MX	10 alt4.aspmx.l.google.com.

;; Query time: 48 msec
...
</pre>

<p>
From the output, we can easily identify that Google is the mail provider for
this blog's domain.  Microsoft hosted mail will be identified by subdomains
such as <code>outlook.com</code> or <code>office365.us</code> or similar.
</p>

<p>
As you can see, it is really not that difficult.
</p>

<div id="outline-container-orgedd155e" class="outline-2">
<h2 id="orgedd155e">Paranoid Queries</h2>
<div class="outline-text-2" id="text-orgedd155e">
<p>
Historically, and still for the most part today, DNS operates over a clear,
readable data gram, UDP port 53.  As a result, if performing these queries
within an environment that may have some amount surveillance over these queries
(employer's resources, university networks, etc.), this may not be sufficiently
passive query.  For example, my university does not allow DNS queries through
anything other than their own servers.  DNS over HTTPS (DoH) still works since
blocking HTTPS wholesale would be a non-starter.
</p>

<p>
Therefore, to run a more paranoid query, we can use a DoH server to perform the
query without completely leaking our questions:
</p>

<div class="org-src-container">
<pre class="src src-bash">curl -H <span style="font-style: italic;">'accept: application/json'</span> <span style="font-style: italic;">'https://1.1.1.1/dns-query?name=nsa.gov&amp;type=MX'</span> | jq .
</pre>
</div>

<p>
Your level of paranoia may differ, but depending on the "target", even querying
Cloudflare with such questions may be "dangerous".
</p>
</div>
</div>

<div id="outline-container-org0d951f6" class="outline-2">
<h2 id="org0d951f6">Legal Caveats and Caution</h2>
<div class="outline-text-2" id="text-org0d951f6">
<p>
While I am certainly not a lawyer, we must of course discuss the legality of
such queries.  Within the United States, the <a href="https://en.wikipedia.org/wiki/Computer_Fraud_and_Abuse_Act">Computer Abuse and Fraud Act</a> is
broadly written and may be used against such queries if the information was
later used for more explicit purposes of attacking such computer systems.
However, the queries themselves are otherwise normal executions of operating a
computer and emailing someone within the organization.  The important
distinction for criminal law, is <i>usually</i> intention.  If the intention is to
commit fraud, then what would otherwise be legal stops being legal.  However,
if the aims are more benign, then there should be nothing to worry about.  To
reiterate, this is not legal advice, I am not a lawyer, jurisdiction
differences may apply.
</p>
</div>
</div>
</div>
<footer id="" class="status">
<footer>
  <p>&copy; 2014-2025 Kenny Ballou.
    <a href="http://creativecommons.org/licenses/by-nc-sa/4.0/">Some rights
      reserved.</a></p>
  <p>Powered by <a href="https://gnu.org">GNU/Linux</a></p>
</footer>
</footer>
</body>
</html>
